HAMES2-1st-3/TunnelComfortSystemTesting/include/tc38xa/IfxDom_bf.h
/**
 * \file IfxDom_bf.h
 * \brief
 * \copyright Copyright (c) 2018 Infineon Technologies AG. All rights reserved.
 *
 *
 * Version: TC38XA_UM_V1.0.0.R0
 * Specification: TC3xx User Manual V1.0.0
 * MAY BE CHANGED BY USER [yes/no]: No
 *
 *                                 IMPORTANT NOTICE
 *
 *
 * Infineon Technologies AG (Infineon) is supplying this file for use
 * exclusively with Infineon's microcontroller products. This file can be freely
 * distributed within development tools that are supporting such microcontroller
 * products.
 *
 * THIS SOFTWARE IS PROVIDED "AS IS".  NO WARRANTIES, WHETHER EXPRESS, IMPLIED
 * OR STATUTORY, INCLUDING, BUT NOT LIMITED TO, IMPLIED WARRANTIES OF
 * MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE APPLY TO THIS SOFTWARE.
 * INFINEON SHALL NOT, IN ANY CIRCUMSTANCES, BE LIABLE FOR SPECIAL, INCIDENTAL,
 * OR CONSEQUENTIAL DAMAGES, FOR ANY REASON WHATSOEVER.
 *
 * \defgroup IfxSfr_Dom_Registers_BitfieldsMask Bitfields mask and offset
 * \ingroup IfxSfr_Dom_Registers
 * 
 */
#ifndef IFXDOM_BF_H
#define IFXDOM_BF_H 1

/******************************************************************************/

/******************************************************************************/

/** \addtogroup IfxSfr_Dom_Registers_BitfieldsMask
 * \{  */
/** \brief Length for Ifx_DOM_SCICTRL_PECON_Bits.PEEN */
#define IFX_DOM_SCICTRL_PECON_PEEN_LEN (1u)

/** \brief Mask for Ifx_DOM_SCICTRL_PECON_Bits.PEEN */
#define IFX_DOM_SCICTRL_PECON_PEEN_MSK (0x1u)

/** \brief Offset for Ifx_DOM_SCICTRL_PECON_Bits.PEEN */
#define IFX_DOM_SCICTRL_PECON_PEEN_OFF (0u)

/** \brief Length for Ifx_DOM_SCICTRL_PECON_Bits.SETPE */
#define IFX_DOM_SCICTRL_PECON_SETPE_LEN (1u)

/** \brief Mask for Ifx_DOM_SCICTRL_PECON_Bits.SETPE */
#define IFX_DOM_SCICTRL_PECON_SETPE_MSK (0x1u)

/** \brief Offset for Ifx_DOM_SCICTRL_PECON_Bits.SETPE */
#define IFX_DOM_SCICTRL_PECON_SETPE_OFF (2u)

/** \brief Length for Ifx_DOM_SCICTRL_PECON_Bits.PEACK */
#define IFX_DOM_SCICTRL_PECON_PEACK_LEN (1u)

/** \brief Mask for Ifx_DOM_SCICTRL_PECON_Bits.PEACK */
#define IFX_DOM_SCICTRL_PECON_PEACK_MSK (0x1u)

/** \brief Offset for Ifx_DOM_SCICTRL_PECON_Bits.PEACK */
#define IFX_DOM_SCICTRL_PECON_PEACK_OFF (4u)

/** \brief Length for Ifx_DOM_SCICTRL_PRIORITY_Bits.MCI0_P */
#define IFX_DOM_SCICTRL_PRIORITY_MCI0_P_LEN (1u)

/** \brief Mask for Ifx_DOM_SCICTRL_PRIORITY_Bits.MCI0_P */
#define IFX_DOM_SCICTRL_PRIORITY_MCI0_P_MSK (0x1u)

/** \brief Offset for Ifx_DOM_SCICTRL_PRIORITY_Bits.MCI0_P */
#define IFX_DOM_SCICTRL_PRIORITY_MCI0_P_OFF (0u)

/** \brief Length for Ifx_DOM_SCICTRL_PRIORITY_Bits.MCI1_P */
#define IFX_DOM_SCICTRL_PRIORITY_MCI1_P_LEN (1u)

/** \brief Mask for Ifx_DOM_SCICTRL_PRIORITY_Bits.MCI1_P */
#define IFX_DOM_SCICTRL_PRIORITY_MCI1_P_MSK (0x1u)

/** \brief Offset for Ifx_DOM_SCICTRL_PRIORITY_Bits.MCI1_P */
#define IFX_DOM_SCICTRL_PRIORITY_MCI1_P_OFF (1u)

/** \brief Length for Ifx_DOM_SCICTRL_PRIORITY_Bits.MCI2_P */
#define IFX_DOM_SCICTRL_PRIORITY_MCI2_P_LEN (1u)

/** \brief Mask for Ifx_DOM_SCICTRL_PRIORITY_Bits.MCI2_P */
#define IFX_DOM_SCICTRL_PRIORITY_MCI2_P_MSK (0x1u)

/** \brief Offset for Ifx_DOM_SCICTRL_PRIORITY_Bits.MCI2_P */
#define IFX_DOM_SCICTRL_PRIORITY_MCI2_P_OFF (2u)

/** \brief Length for Ifx_DOM_SCICTRL_PRIORITY_Bits.MCI3_P */
#define IFX_DOM_SCICTRL_PRIORITY_MCI3_P_LEN (1u)

/** \brief Mask for Ifx_DOM_SCICTRL_PRIORITY_Bits.MCI3_P */
#define IFX_DOM_SCICTRL_PRIORITY_MCI3_P_MSK (0x1u)

/** \brief Offset for Ifx_DOM_SCICTRL_PRIORITY_Bits.MCI3_P */
#define IFX_DOM_SCICTRL_PRIORITY_MCI3_P_OFF (3u)

/** \brief Length for Ifx_DOM_SCICTRL_PRIORITY_Bits.MCI4_P */
#define IFX_DOM_SCICTRL_PRIORITY_MCI4_P_LEN (1u)

/** \brief Mask for Ifx_DOM_SCICTRL_PRIORITY_Bits.MCI4_P */
#define IFX_DOM_SCICTRL_PRIORITY_MCI4_P_MSK (0x1u)

/** \brief Offset for Ifx_DOM_SCICTRL_PRIORITY_Bits.MCI4_P */
#define IFX_DOM_SCICTRL_PRIORITY_MCI4_P_OFF (4u)

/** \brief Length for Ifx_DOM_SCICTRL_PRIORITY_Bits.MCI5_P */
#define IFX_DOM_SCICTRL_PRIORITY_MCI5_P_LEN (1u)

/** \brief Mask for Ifx_DOM_SCICTRL_PRIORITY_Bits.MCI5_P */
#define IFX_DOM_SCICTRL_PRIORITY_MCI5_P_MSK (0x1u)

/** \brief Offset for Ifx_DOM_SCICTRL_PRIORITY_Bits.MCI5_P */
#define IFX_DOM_SCICTRL_PRIORITY_MCI5_P_OFF (5u)

/** \brief Length for Ifx_DOM_SCICTRL_PRIORITY_Bits.MCI6_P */
#define IFX_DOM_SCICTRL_PRIORITY_MCI6_P_LEN (1u)

/** \brief Mask for Ifx_DOM_SCICTRL_PRIORITY_Bits.MCI6_P */
#define IFX_DOM_SCICTRL_PRIORITY_MCI6_P_MSK (0x1u)

/** \brief Offset for Ifx_DOM_SCICTRL_PRIORITY_Bits.MCI6_P */
#define IFX_DOM_SCICTRL_PRIORITY_MCI6_P_OFF (6u)

/** \brief Length for Ifx_DOM_SCICTRL_PRIORITY_Bits.MCI7_P */
#define IFX_DOM_SCICTRL_PRIORITY_MCI7_P_LEN (1u)

/** \brief Mask for Ifx_DOM_SCICTRL_PRIORITY_Bits.MCI7_P */
#define IFX_DOM_SCICTRL_PRIORITY_MCI7_P_MSK (0x1u)

/** \brief Offset for Ifx_DOM_SCICTRL_PRIORITY_Bits.MCI7_P */
#define IFX_DOM_SCICTRL_PRIORITY_MCI7_P_OFF (7u)

/** \brief Length for Ifx_DOM_SCICTRL_PRIORITY_Bits.MCI8_P */
#define IFX_DOM_SCICTRL_PRIORITY_MCI8_P_LEN (1u)

/** \brief Mask for Ifx_DOM_SCICTRL_PRIORITY_Bits.MCI8_P */
#define IFX_DOM_SCICTRL_PRIORITY_MCI8_P_MSK (0x1u)

/** \brief Offset for Ifx_DOM_SCICTRL_PRIORITY_Bits.MCI8_P */
#define IFX_DOM_SCICTRL_PRIORITY_MCI8_P_OFF (8u)

/** \brief Length for Ifx_DOM_SCICTRL_PRIORITY_Bits.MCI9_P */
#define IFX_DOM_SCICTRL_PRIORITY_MCI9_P_LEN (1u)

/** \brief Mask for Ifx_DOM_SCICTRL_PRIORITY_Bits.MCI9_P */
#define IFX_DOM_SCICTRL_PRIORITY_MCI9_P_MSK (0x1u)

/** \brief Offset for Ifx_DOM_SCICTRL_PRIORITY_Bits.MCI9_P */
#define IFX_DOM_SCICTRL_PRIORITY_MCI9_P_OFF (9u)

/** \brief Length for Ifx_DOM_SCICTRL_PRIORITY_Bits.MCI10_P */
#define IFX_DOM_SCICTRL_PRIORITY_MCI10_P_LEN (1u)

/** \brief Mask for Ifx_DOM_SCICTRL_PRIORITY_Bits.MCI10_P */
#define IFX_DOM_SCICTRL_PRIORITY_MCI10_P_MSK (0x1u)

/** \brief Offset for Ifx_DOM_SCICTRL_PRIORITY_Bits.MCI10_P */
#define IFX_DOM_SCICTRL_PRIORITY_MCI10_P_OFF (10u)

/** \brief Length for Ifx_DOM_SCICTRL_PRIORITY_Bits.MCI11_P */
#define IFX_DOM_SCICTRL_PRIORITY_MCI11_P_LEN (1u)

/** \brief Mask for Ifx_DOM_SCICTRL_PRIORITY_Bits.MCI11_P */
#define IFX_DOM_SCICTRL_PRIORITY_MCI11_P_MSK (0x1u)

/** \brief Offset for Ifx_DOM_SCICTRL_PRIORITY_Bits.MCI11_P */
#define IFX_DOM_SCICTRL_PRIORITY_MCI11_P_OFF (11u)

/** \brief Length for Ifx_DOM_SCICTRL_PRIORITY_Bits.HPRS */
#define IFX_DOM_SCICTRL_PRIORITY_HPRS_LEN (3u)

